In [4]:
 #!pip install psycopg2 sqlalchemy pandas

In [5]:
import pandas as pd
from sqlalchemy import create_engine

In [6]:
# PostgreSQL Connection URL
DATABASE_URL = "postgresql://postgres:mary1956@localhost:5432/cc"

# Create an SQLAlchemy engine
engine = create_engine(DATABASE_URL, echo=False)

In [7]:
query = "SELECT * FROM customers"
df = pd.read_sql(query, engine)

# Display the DataFrame
print(df.head())

   customer_id customer_name    reg_date
0            1   Arjun Mehta  2023-03-10
1            2  Priya Sharma  2023-04-15
2            3  Vikram Singh  2023-05-01
3            4    Ritu Patel  2023-06-05
4            5    Aman Gupta  2023-07-12

# Top 5 Most Frequently Ordered Dishes

In [8]:
query = ("SELECT count(order_item) as ordered , order_item from public.orders, public.customers where public.orders.customer_id=public.customers.customer_id group by order_item   order by ordered desc limit 5;")

top_5 = pd.read_sql(query, engine)

# Display the DataFrame
print(top_5.head())

   ordered            order_item
0      754       Chicken Biryani
1      751  Paneer Butter Masala
2      729         Pasta Alfredo
3      728           Masala Dosa
4      718     Mutton Rogan Josh

# Q2. Popular Time Slots

## Question: Identify the time slots during which the most orders are placed, based on 2-hour intervals.

In [10]:
query = ("SELECT date_trunc ('hour', order_time) +  interval '1 hour' *( extract (hour from order_time)/2) as time_slot ,count(*) as total_orders from public.orders group by time_slot  order by total_orders desc ;")

timeslot = pd.read_sql(query, engine)

# Display the DataFrame
timeslot

         time_slot  total_orders
0  0 days 21:00:00           596
1  1 days 04:30:00           596
2  0 days 22:30:00           592
3  1 days 09:00:00           591
4  0 days 16:30:00           561
5  1 days 01:30:00           560
6  0 days 18:00:00           558
7  0 days 19:30:00           557
8  0 days 10:30:00           553
9  1 days 06:00:00           551
10 0 days 15:00:00           546
11 1 days 03:00:00           540
12 0 days 13:30:00           539
13 1 days 07:30:00           538
14 0 days 12:00:00           537
15 1 days 10:30:00           532
16 0 days 09:00:00           521
17 1 days 00:00:00           520
18 0 days 00:00:00            12

# Q3. Order Value Analysis
## Question: Find the average order value (AOV) per customer who has placed more than 750 orders.return: `customer_name`, `aov (average order value`).

In [ ]:
query=("SELECT c.customer_name,AVG(o.total_amount) as aov FROM orders as o JOIN customers as c ON c.customer_id = o.customer_id GROUP BY 1 HAVING  COUNT(order_id) > 750")
aov = pd.read_sql(query, engine)

# Display the DataFrame
aov

  customer_name         aov
0    Aman Gupta  333.318653
1   Rahul Verma  339.060802
2   Sneha Desai  333.577447

# Q4. High-Value Customers

## Question:List the customers who have spent more than 100K in total on food orders.Return: customer_name, customer_id.

In [26]:
query=("select c.customer_name, c.customer_id from orders o  inner join customers c    on o.customer_id= c.customer_id   group by c.customer_name, c.customer_id    having sum(o.total_amount)>100000;")
high_value = pd.read_sql(query, engine)

# Display the DataFrame
high_value

      customer_name  customer_id
0   Kavita Malhotra           22
1       Nikhil Jain           15
2      Aakash Dubey           19
3        Aman Gupta            5
4        Ritu Patel            4
5       Sneha Desai            6
6       Rahul Verma            7
7    Bhavna Agarwal           20
8      Shreya Ghosh           18
9        Neha Joshi            8
10     Karan Kapoor            9
11   Ramesh Chandra           21
12  Manish Kulkarni           17
13      Aarti Yadav           16

# Q5. Orders Without Delivery 
## Question: Write a query to find orders that were placed but not delivered. Return: restaurant_name, city, and the number of not delivered orders.

In [28]:
query= ("select r.restaurant_name,r.city from  deliveries d   LEFT JOIN orders o  on d.order_id = o.order_id   LEFT JOIN  restaurants r  on o.restaurant_id = r.restaurant_id where d.delivery_status = 'Not Delivered';")
not_delivered=pd.read_sql(query,engine)
not_delivered

            restaurant_name       city
0                  Yauatcha     Mumbai
1         Punjabi By Nature      Delhi
2                    Gulati      Delhi
3              Leopold Cafe     Mumbai
4                Cafe Bahar  Hyderabad
..                      ...        ...
538              The Oberoi  Bengaluru
539    Windmills Craftworks  Bengaluru
540  Dindigul Thalappakatti    Chennai
541         The Spicy Venue  Hyderabad
542           The Fatty Bao  Bengaluru

[543 rows x 2 columns]

# Restaurant Revenue Ranking
## Question: Rank restaurants by their total revenue from the last year. Return: restaurant_name, total_revenue, and their rank within their city.

In [29]:
query=("with ranking_table as (select   r.city,r.restaurant_name,SUM(o.total_amount) AS total_revenue ,RANK() OVER (PARTITION BY r.city ORDER BY SUM(o.total_amount) DESC) AS rank_within_city from orders o join restaurants r on   r.restaurant_id =  o.restaurant_id  WHERE     o.order_date >= DATE_TRUNC('year', CURRENT_DATE) - INTERVAL '1 year'     AND o.order_date < DATE_TRUNC('year',CURRENT_DATE) GROUP BY 1, 2 ) select * FROM ranking_table WHERE rank_within_city = 1;")
ranking= pd.read_sql(query,engine)
ranking

        city      restaurant_name  total_revenue  rank_within_city
0  Bengaluru         Corner House          293.0                 1
1      Delhi  Olive Bar & Kitchen          493.0                 1
2  Hyderabad         Almond House          749.0                 1
3     Mumbai              Gajalee          897.0                 1

# Most Popular Dish by City
## Question: Identify the most popular dish in each city based on the number of orders.

In [32]:

query=("SELECT * FROM(SELECT 	r.city,	o.order_item as dish,	COUNT(order_id) as total_orders,RANK() OVER(PARTITION BY r.city ORDER BY COUNT(order_id) DESC) as rank FROM orders as o JOIN restaurants as r ON r.restaurant_id = o.restaurant_id GROUP BY 1, 2 ) as t1 WHERE rank = 1")
dish_city= pd.read_sql(query,engine)
dish_city

        city                  dish  total_orders  rank
0  Bengaluru       Chicken Biryani           172     1
1    Chennai     Mutton Rogan Josh            74     1
2      Delhi  Paneer Butter Masala            97     1
3  Hyderabad       Chicken Biryani            81     1
4     Mumbai  Paneer Butter Masala           363     1

In [9]:
engine.dispose()